[
  {
    "url": "https://jiomeetpro.jio.com/webhelp",
    "content": "+91 8369 100 100\nDownload App\nHelp\nSign In\nEnglish\nProducts\nUse Cases\nSales\nPricing\nMore\nJoin a Meeting\nSign Up\n\n\n\nTOPICS\nGetting Started\nHow to Use JioMeet\nIn Call Host Controls\nIn Call Meeting Features\nJioMeet for Outlook Add-in\nTroubleshoot\nJioMeet Plus\nJioMeet Enterprise\nKeyboard Shortcuts\nContact Us\nGetting Started\nSign in to JioMeet on Windows\nLearn how to sign in into JioMeet desktop application from your Windows machine.\n46 sec | 21/03/2021\nSign up for JioMeet on macOS\nKnow how to sign up a new with the JioMeet desktop application to experience a happy meeting from your MAC machine.\n43 sec | 21/03/2021\nSign up on JioMeet App with iOS Device\nExplore how to sign up a new with the JioMeet mobile application to experience a happy meeting from your iOS device.\n72 sec | 21/03/2021\nSign Up on JioMeet on Android\nKnow how to sign up a new with the JioMeet mobile application to experience a happy meeting from your Android device.\n72 sec | 21/03/2021\nSign up on JioMeet on Windows\nKnow how to sign up a new with the JioMeet desktop application to experience a happy meeting from your Windows machine.\n83 sec | 21/03/2021\nSign in on JioMeet on macOS\nKnow how to sign in into JioMeet desktop application using your MAC desktop.\n37 sec | 21/03/2021\nSign in on JioMeet Website\nLearn how to sign in into JioMeet website (WebRTC) application.\n44 sec | 21/03/2021\nSign in on JioMeet App with iOS device\nLearn how to sign in into JioMeet mobile application using your iOS device.\n41 sec | 21/03/2021\nSign up for JioMeet on Website\nKnow how to sign up a new with the JioMeet Website application to experience a happy meeting without desktop or mobile applications.\n44 sec | 21/03/2021\nSign In to JioMeet on Android\nLearn how to sign in into JioMeet desktop application from your Android machine.\n45 sec | 21/03/2021\n\nYour browser does not support the playback of this video. Please try using a different browser.\n\nFAQ\nUser Guides\nHow can I download JioMeet App?\nOn Mobile Device – Go to Play Store/AppStore, download the Android or iOS app.\nOn Windows – Visit Download JioMeet for Windows and download the JioMeet application.\nOn macOS – Visit Download JioMeet for Mac and download the JioMeet application.\nOn JioFiber STB- Go to JioStore, download the JioMeet app for your TV running on JioFiber STB\nWhat are the recommended system requirements to attend a JioMeet call?\nResources\tSpecificationsAndroid\t5.0 and above with min. 2GB RAM\niOS\t12.1 and above with min. 1 GB RAM\nMac\t10.13 and above with min. 2GB RAM\nWindows\t10 and above (64-bit CPU only) and min. 8GB RAM\nGoogle Chrome\t83 and above\nSafari\t13.1.1 and above\nBandwidth\t1 Mbps (each for up-stream and down-stream)\n\nThe virtual background feature has high performance requirements. Make sure your computer meets the following requirements:\n\nCPU: Intel Core i5 4 cores or higher\n8G RAM or more\n64-bit operating system\nBrowser: Chrome latest version (Mobile browsers are not recommended to enable virtual background)\nWhat is the maximum number of participants I can invite to a call/meeting?\n\nIncluding the host, you can invite up to 250 participants.\n\nHow do I Join/Host a JioMeet Meeting?\n\nYou can Join/Host a JioMeet Meeting through:\n\nMobile- Using JioMeet’s Android or iOS app\nDesktop- Using JioMeet’s Windows or MAC app\nWebApp- Using Safari or Google Chrome Browser\nTV- Through JioFiber STB’s JioMeet App\nWhat is the maximum time duration for a JioMeet Meeting?\n\nJioMeet meeting can last for a maximum of 23 hours 30 minutes.\n\nHow do i experience the best video quality?\n\nThe video quality that you can get depends on the device you use and the network you are connected to. Considering you are connected to the wired network with dedicated bandwidth you can experience High definition (720p) video quality."
  }
]